import pandas as pd

# 기본 인덱스는 의ㅣ가 없음, 여기서는 일자 컬럼을 인덱스로 지정해보자
sample = pd.read_csv("./csvFile/내국인 생활인구.csv", encoding="cp949", index_col=0)
# 첫번째 컬럼을 인덱스로 지정
print(sample.head())
# 소괄호만 들어가 있으므로 위에서부터 다섯개만 출력
#                 시간(tmzon_pd_se)  행정동코드(adstrd_code_se)   집계구코드(oa_cd)  ...  여자75~79세(female_f75t79_lvpop_co)  여자80세이상(female_above_80_lvpop_co)      등록일자(ldadng_dt)
# 일자(stdr_de_id)                                                         ...

# 20170226                      4               11320515  1125061020007  ...                            2.3141                             9.7668  2021-08-17 16:06:44
# 20180107                     22               11380510  1115071010309  ...                            4.6111                            18.1781  2021-08-17 16:06:44
# 20180317                      6               11680610  1113073020101  ...                            3.8434                             4.4772  2021-08-17 16:06:44
# 20190222                      7               11305575  1106071020403  ...                            1.8361                             7.7510  2021-08-17 16:06:44
# 20210706                      6               11740660  1107073040015  ...                           85.6665                            95.0249  2021-08-17 16:06:44
# [5 rows x 37 columns]

print(sample.tail())
# 아래에서 부터 다섯개
#                 시간(tmzon_pd_se)  행정동코드(adstrd_code_se)   집계구코드(oa_cd)  ...  여자75~79세(female_f75t79_lvpop_co)  여자80세이상(female_above_80_lvpop_co)      등록일자(ldadng_dt)
# 일자(stdr_de_id)                                                         ...

# 20170603                      7               11650560  1122057010104  ...                           13.5570                            17.3543  2021-08-17 16:06:44
# 20211007                      5               11620525  1111056061002  ...                           15.6473                             6.1426  2021-08-17 16:06:44
# 20200819                     20               11140635  1121078010101  ...                            3.3179                            13.5500  2021-08-17 16:06:44
# 20171011                     11               11590605  1121082010004  ...                            9.3403                             0.0000  2021-08-17 16:06:44
# 20200725                     21               11350625  1115053030001  ...                            6.0132                             4.8362  2021-08-17 16:06:44
# [5 rows x 37 columns]

sample = sample.set_index("일자(stdr_de_id)")
sample.head()
# 이렇게 set_index라는 함수를 사용해서 추후에 인덱스 설정도 가능
# 외울 필요는 없고 pandas index 설정 검색하면 모니터링 가능